final List<Map<String, dynamic>> top10Data = [
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا لبرشلونة في دوري أبطال أوروبا؟",
    "answers": [
      "ليونيل ميسي",
      "لويس سواريز",
      "نيمار",
      "ريفالدو",
      "باتريك كلويفرت",
      "صامويل إيتو",
      "تييري هنري",
      "بيدرو رودريغيز",
      "جيرارد بيكيه",
      "دافيد فيا",
      "عثمان ديمبيلي",
      "سيرجيو بوسكيتس",
      "أنطوان غريزمان"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا شاركوا مع برشلونة في دوري أبطال أوروبا عبر التاريخ؟",
    "answers": [
      "ليونيل ميسي",
      "تشافي هيرنانديز",
      "أندريس إنييستا",
      "جيرارد بيكيه",
      "فيكتور فالديس",
      "كارليس بويول",
      "سيرجيو بوسكيتس",
      "داني ألفيش",
      "بيدرو رودريغيز",
      "تير شتيغن",
      "نيمار",
      "لويس سواريز",
      "رافينيا"
    ]
  },
  {
    "question": "من هم أكثر 13 مدربًا قادوا برشلونة في عدد المباريات الرسمية؟",
    "answers": [
      "بيب جوارديولا",
      "فرانك ريكارد",
      "لويس إنريكي",
      "يوهان كرويف",
      "إرنستو فالفيردي",
      "رونالد كومان",
      "تيتو فيلانوفا",
      "لويس فان خال",
      "كارليس ريكساش",
      "بobby Robson",
      "تاتا مارتينو",
      "تيري فينابلز",
      "تشافي هيرنانديز"
    ]
  },
  {
    "question":
        "من هم أبرز 13 لاعبًا في تاريخ برشلونة حصلوا على الكرة الذهبية أثناء لعبهم للنادي؟",
    "answers": [
      "ليونيل ميسي",
      "يوهان كرويف",
      "رونالدو البرازيلي",
      "ريفالدو",
      "رونالدينيو",
      "لويس سواريز (الإسباني)",
      "هريستو ستويتشكوف",
      "ساميتشيل",
      "لويس إنريكي (مرشح سابقًا)",
      "تشافي (ضمن الثلاثة الأوائل)",
      "إنييستا (ضمن الثلاثة الأوائل)",
      "نيمار (ضمن الثلاثة الأوائل)",
      "أنطوان غريزمان (مرشح)"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا صناعة للأهداف في تاريخ برشلونة في كل البطولات؟",
    "answers": [
      "ليونيل ميسي",
      "تشافي",
      "إنييستا",
      "لويس سواريز",
      "داني ألفيش",
      "نيمار",
      "بيدرو",
      "رافينيا",
      "هنري",
      "رونالدينيو",
      "ريفالدو",
      "فابريغاس",
      "غريزمان"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا لريال مدريد في دوري أبطال أوروبا؟",
    "answers": [
      "كريستيانو رونالدو",
      "راؤول غونزاليس",
      "كريم بنزيما",
      "ألفريدو دي ستيفانو",
      "فرينك بوشكاش",
      "غاريث بيل",
      "رونالدو نازاريو",
      "لويس فيغو",
      "روبرتو كارلوس",
      "إيسكو",
      "ماركو أسينسيو",
      "لوكا مودريتش",
      "سيرجيو راموس"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا مشاركة مع ريال مدريد في دوري الأبطال؟",
    "answers": [
      "إيكر كاسياس",
      "كريستيانو رونالدو",
      "سيرجيو راموس",
      "كريم بنزيما",
      "مارسيلو",
      "لوكا مودريتش",
      "توني كروس",
      "روبرتو كارلوس",
      "راؤول",
      "فيرناندو هييرو",
      "كاسييميرو",
      "غاريث بيل",
      "بيبي"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا لليفربول في دوري أبطال أوروبا؟",
    "answers": [
      "محمد صلاح",
      "ستيفن جيرارد",
      "روبرتو فيرمينو",
      "ساديو ماني",
      "إيان راش",
      "لويس غارسيا",
      "ديرك كويت",
      "فيرجيل فان دايك",
      "جيمس ميلنر",
      "جوردان هندرسون",
      "فينالدوم",
      "فرناندو توريس",
      "كيني دالغليش"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا مشاركة مع ليفربول في دوري الأبطال؟",
    "answers": [
      "ستيفن جيرارد",
      "محمد صلاح",
      "جيمس ميلنر",
      "ساديو ماني",
      "فيرمينو",
      "هندرسون",
      "جيمي كاراغر",
      "أليسون بيكر",
      "أرنولد",
      "فيرجيل فان دايك",
      "فابينيو",
      "فينالدوم",
      "إيان راش"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا لمانشستر يونايتد في دوري أبطال أوروبا؟",
    "answers": [
      "واين روني",
      "رود فان نيستلروي",
      "ريان غيغز",
      "كريستيانو رونالدو",
      "بول سكولز",
      "دوايت يورك",
      "أندي كول",
      "أولي جونار سولشاير",
      "ديفيد بيكهام",
      "كارلوس تيفيز",
      "ناني",
      "روبن فان بيرسي",
      "إريك كانتونا"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا مشاركة مع مانشستر يونايتد في دوري الأبطال؟",
    "answers": [
      "ريان غيغز",
      "بول سكولز",
      "واين روني",
      "كريستيانو رونالدو",
      "روي كين",
      "نيمانيا فيديتش",
      "ريو فيرديناند",
      "ديفيد دي خيا",
      "غاري نيفيل",
      "باتريس إيفرا",
      "مايكل كاريك",
      "دوايت يورك",
      "أندي كول"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا ليوفنتوس في دوري أبطال أوروبا؟",
    "answers": [
      "أليساندرو دل بييرو",
      "روبرتو باجيو",
      "فيليبو إنزاجي",
      "باولو ديبالا",
      "كريستيانو رونالدو",
      "دافيد تريزيجيه",
      "زين الدين زيدان",
      "كارلوس تيفيز",
      "ألفارو موراتا",
      "فيدال",
      "إدغار ديفيدز",
      "كوينتراو",
      "ماركيزيو"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا مشاركة مع يوفنتوس في دوري الأبطال؟",
    "answers": [
      "جيانلويجي بوفون",
      "أليساندرو دل بييرو",
      "كليني",
      "بارزالي",
      "بونوتشي",
      "ديبالا",
      "نيدفيد",
      "ماركيزيو",
      "كريستيانو رونالدو",
      "فيدال",
      "تريزيجيه",
      "بيرلو",
      "ليشتشتاينر"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا لميلان في دوري أبطال أوروبا؟",
    "answers": [
      "أندري شيفشينكو",
      "كاكا",
      "فيليبو إنزاجي",
      "كلارينس سيدورف",
      "جورج وياه",
      "هرنان كريسبو",
      "رونالدو البرازيلي",
      "إبراهيموفيتش",
      "باتو",
      "روبرتو باجيو",
      "رود غوليت",
      "ماركو فان باستن",
      "فرانك ريكارد"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا مشاركة مع ميلان في دوري الأبطال؟",
    "answers": [
      "باولو مالديني",
      "أليساندرو نيستا",
      "كلارينس سيدورف",
      "كاكا",
      "إنزاجي",
      "شيفشينكو",
      "ديدا",
      "جاتوزو",
      "أندريا بيرلو",
      "رونالدينيو",
      "زلاتان إبراهيموفيتش",
      "باتو",
      "أمبروزيني"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا لباريس سان جيرمان في دوري أبطال أوروبا؟",
    "answers": [
      "كيليان مبابي",
      "إدينسون كافاني",
      "نيمار",
      "ليونيل ميسي",
      "زلاتان إبراهيموفيتش",
      "أنخيل دي ماريا",
      "ماركو فيراتي",
      "لوكاس مورا",
      "ماورو إيكاردي",
      "دراكسلر",
      "جيسي رودريغيز",
      "تياجو سيلفا",
      "ديفيد لويز"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا مشاركة مع باريس سان جيرمان في دوري الأبطال؟",
    "answers": [
      "ماركو فيراتي",
      "كافاني",
      "تياغو سيلفا",
      "مبابي",
      "نيمار",
      "دي ماريا",
      "ماركينيوس",
      "سيرجيو راموس",
      "كيلور نافاس",
      "لوكاس مورا",
      "كيمبيمبي",
      "دراكسلر",
      "رابيو"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا لمصر في كأس الأمم الأفريقية؟",
    "answers": [
      "حسام حسن",
      "محمد أبو تريكة",
      "محمد صلاح",
      "أحمد حسن",
      "حسن الشاذلي",
      "جمال عبد الحميد",
      "عماد متعب",
      "عمرو زكي",
      "مجدي عبد الغني",
      "طارق مصطفى",
      "محمد ناجي جدو",
      "محمد زيدان",
      "أحمد الكاس"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا مشاركة مع مصر في كأس الأمم الأفريقية؟",
    "answers": [
      "أحمد حسن",
      "عصام الحضري",
      "وائل جمعة",
      "أحمد فتحي",
      "محمد صلاح",
      "حسني عبد ربه",
      "محمد النني",
      "طارق حامد",
      "أبو تريكة",
      "حسام حسن",
      "عبد الظاهر السقا",
      "سيد معوض",
      "أحمد المحمدي"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا سجلوا أهدافًا في تاريخ كأس العالم؟",
    "answers": [
      "ميروسلاف كلوزه",
      "رونالدو البرازيلي",
      "جيرد مولر",
      "جاست فونتين",
      "ليونيل ميسي",
      "كيليان مبابي",
      "بيليه",
      "هاري كين",
      "توماس مولر",
      "دييغو مارادونا",
      "دافيد فيا",
      "غابرييل باتيستوتا",
      "زين الدين زيدان"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا مشاركة في مباريات كأس العالم؟",
    "answers": [
      "ليونيل ميسي",
      "لوثار ماتيوس",
      "ميروسلاف كلوزه",
      "باولو مالديني",
      "كريستيانو رونالدو",
      "مارادونا",
      "خافيير ماسكيرانو",
      "أندريس إنييستا",
      "فيليب لام",
      "جيانلويجي بوفون",
      "داني ألفيش",
      "رافاييل ماركيز",
      "كافو"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا للنادي الأهلي في دوري أبطال أفريقيا؟",
    "answers": [
      "محمود الخطيب",
      "محمد أبو تريكة",
      "عماد متعب",
      "وليد سليمان",
      "حسام حسن",
      "فلافيو",
      "محمد بركات",
      "أحمد عبد الظاهر",
      "أحمد بلال",
      "جونيور أجايي",
      "أحمد فتحي",
      "طاهر محمد طاهر",
      "مروان محسن"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا شاركوا مع النادي الأهلي في دوري أبطال أفريقيا؟",
    "answers": [
      "محمد أبو تريكة",
      "وائل جمعة",
      "شادي محمد",
      "أحمد فتحي",
      "حسام عاشور",
      "سيد عبد الحفيظ",
      "رمضان صبحي",
      "عماد متعب",
      "محمد بركات",
      "وليد سليمان",
      "شريف إكرامي",
      "سعد سمير",
      "أحمد أيمن منصور"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا لنادي الزمالك في البطولات الأفريقية؟",
    "answers": [
      "حازم إمام",
      "شيكابالا",
      "أحمد جعفر",
      "أوباما",
      "باسم مرسي",
      "عبد الحليم علي",
      "طارق يحيى",
      "مصطفى محمد",
      "أشرف بن شرقي",
      "حميد أحداد",
      "شيكابالا",
      "كابونجو كاسونجو",
      "طارق حامد"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا في تاريخ الدوري المصري الممتاز؟",
    "answers": [
      "حسام حسن",
      "عبدالله السعيد",
      "مصطفى رياض",
      "محمد أبو تريكة",
      "أحمد الكاس",
      "علي أبو جريشة",
      "جمال عبد الحميد",
      "محمود الخطيب",
      "عبد الحليم علي",
      "رضا عبد العال",
      "عماد متعب",
      "أحمد جعفر",
      "أحمد رؤوف"
    ]
  },
  {
    "question":
        "من هم أكثر 13 لاعبًا سجلوا أهدافًا في الدوري الإنجليزي الممتاز؟",
    "answers": [
      "آلان شيرر",
      "هاري كين",
      "واين روني",
      "سيرجيو أجويرو",
      "فرانك لامبارد",
      "تييري هنري",
      "روبن فان بيرسي",
      "جيمي فاردي",
      "مايكل أوين",
      "لس فيرديناند",
      "روبي فاولر",
      "جيرمن ديفو",
      "ديدييه دروجبا"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا سجلوا أهدافًا في كأس الأمم الأفريقية؟",
    "answers": [
      "صامويل إيتو",
      "لوران بوكو",
      "رشيد يكني",
      "باتريك مبوما",
      "ديدييه دروجبا",
      "حسام حسن",
      "أحمد حسن",
      "جون أوبي ميكيل",
      "أوبافيمي مارتينز",
      "بيني مكارثي",
      "كالوشا بواليا",
      "سيدو كيتا",
      "إيمانويل أديبايور"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا سجلوا أهدافًا في دوري أبطال أفريقيا؟",
    "answers": [
      "محمد أبو تريكة",
      "محمود الخطيب",
      "وليد سليمان",
      "فلافيو",
      "أشرف بن شرقي",
      "ياسين الشيخاوي",
      "تيبو مازوندي",
      "حسام حسن",
      "مصطفى محمد",
      "أحمد عبد الظاهر",
      "فيريرا",
      "يوسف بلايلي",
      "محمد بركات"
    ]
  },
  {
    "question": "من هم أكثر 13 لاعبًا سجلوا أهدافًا في دوري أبطال أوروبا؟",
    "answers": [
      "كريستيانو رونالدو",
      "ليونيل ميسي",
      "روبرت ليفاندوفسكي",
      "كريم بنزيما",
      "راؤول",
      "رود فان نيستلروي",
      "تييري هنري",
      "أندريه شيفشينكو",
      "توماس مولر",
      "ديدييه دروجبا",
      "إبراهيموفيتش",
      "نيمار",
      "ساديو ماني"
    ]
  }
];
